'''
Дробная часть

Дано положительное действительное число X. Выведите его дробную часть.
Формат ввода: Вводится положительное действительное число.
'''

x = float(input())
fract = x - int(x)

print(fract)
