'''
Замена подстроки

Дана строка.
Замените в этой строке все цифры 1 на слово one.
'''

s = input()
src = '1'
dest = 'one'
result = s.replace(src, dest)
print(result)
