'''
Task 1-07: Первая цифра двузначного числа
Дано положительное двузначное число. Найдите число десятков в нем.

Вводится единственное число
(гарантируется, что оно соответствует условию задачи).
'''

print(int(input()) // 10)
