'''
Task 1-05: Степень двойки

Вводится целое неотрицательное число N (N≤100).
Выведите 2ᴺ.
'''

print(2 ** int(input()))
