'''
Task 1-06: Последняя цифра

Дано натуральное число. Выведите его последнюю цифру.
Вводится единственное целое положительное число (гарантируется, что оно не превышает 10000).
'''

print(int(input()) % 10)
